[
    {
        "id": "item_1",
        "title": "Item: Blink Dagger",
        "text": "**Blink Dagger Item Report**\n\n**1. Overview**\n\nThe Blink Dagger is a powerful item in Dota 2 that allows its wielder to teleport a significant distance across the map, making it an essential tool for many heroes. This item is a game-changer in team fights, allowing for quick repositioning, escapes, and initiations.\n\n**2. Components**\n\nThe Blink Dagger has no components and is a standalone item.\n\n**3. Stats & Effects**\n\n* **Active Ability: Blink**\n\t+ Teleport to a target point up to 1200 units away.\n\t+ Cooldown: 15 seconds.\n\t+ Mana Cost: None.\n\t+ Damage Cooldown: 3 seconds after taking damage from an enemy hero or Roshan.\n* **Self-casting**: Teleports in the direction of the team's fountain.\n* **Range Clamp**: If the target distance is over the maximum range, teleports 4/5 of the maximum range instead.\n\n**4. Usage Tips**\n\n* Use Blink Dagger to initiate team fights, surprise enemies, or reposition yourself quickly.\n* Blink Dagger is most effective when used in conjunction with other abilities, such as spells or ultimates.\n* Be mindful of the cooldown and damage cooldown to avoid wasting the ability.\n* Use self-casting to quickly return to your team's fountain or to escape danger.\n\n**5. Strategic Value**\n\nThe Blink Dagger is a highly valuable item in Dota 2, offering unparalleled mobility and flexibility. Its ability to teleport a significant distance allows heroes to:\n\n* Initiate team fights and catch enemies off guard.\n* Reposition themselves quickly to avoid danger or get to a better position.\n* Escape from enemy heroes or Roshan.\n* Support allies by quickly repositioning to a more advantageous location.\n\nOverall, the Blink Dagger is a must-have item for many heroes, especially those that rely on agility and quick movements. Its strategic value lies in its ability to turn the tide of a team fight or escape from a difficult situation.",
        "abstract": "The Blink Dagger is an item in Dota 2 that allows its wielder to teleport up to 1200 units away, with a 15-second cooldown and a 3-second damage cooldown after taking damage from an enemy hero or Roshan. It has no mana cost and can be self-cast to teleport in the direction of the team's fountain.",
        "metadata": {
            "cooldown_tag": "medium_cooldown",
            "mana_tag": "no_mana",
            "health_tag": "no_health",
            "cost_tag": "expensive",
            "damage_tag": "no_damage",
            "behavior_traits": [
                "ground-targeted",
                "toggleable",
                "ignore channel cancel"
            ],
            "special_attributes": {
                "blink_range": 1200,
                "blink_damage_cooldown": 3,
                "blink_range_clamp": 960,
                "AbilityCastRange": 1200,
                "AbilityCooldown": 15
            },
            "suggested_times": [
                "late"
            ],
            "id": 1,
            "name": "item_blink",
            "name_loc": "Blink Dagger",
            "desc_loc": "<h1>Active: Blink</h1> Teleport to a target point up to %blink_range% units away. <br><br>Blink Dagger cannot be used for %blink_damage_cooldown% seconds after taking damage from an enemy hero or Roshan.",
            "lore_loc": "The fabled dagger used by the fastest assassin ever to walk the lands.",
            "notes_loc": [
                "Self-casting will cause you to teleport in the direction of your team's fountain.",
                "If you used Blink to teleport to a distance over the maximum range, you'll be teleported 4/5 of the maximum range instead."
            ],
            "behavior": "274878432272",
            "is_item": true,
            "item_cost": 2250,
            "item_neutral_tier": 4294967295,
            "item_quality": 1
        }
    },
    {
        "id": "item_600",
        "title": "Item: Overwhelming Blink",
        "text": "**1. Overview**\n\nOverwhelming Blink is a high-end item that combines the functionality of a Blink Dagger with the damage-dealing capabilities of a Reaver. It allows the wielder to teleport to a target point, dealing damage to enemies in a small radius and slowing their movement and attack speed.\n\n**2. Components**\n\n* Blink Dagger: provides the teleportation ability\n* Reaver: adds damage-dealing and slow effects to the teleportation ability\n\n**3. Stats & Effects**\n\n* **Teleportation**: Overwhelming Blink allows the wielder to teleport to a target point up to 1200 units away (clamped to 960 units if the target is further away).\n* **Damage**: Deals damage equal to 100 + 50% of the wielder's strength to enemies in a 800 unit radius.\n* **Damage Over Time**: Deals an additional 100% of the wielder's strength over time to enemies in the radius.\n* **Movement Slow**: Slows enemy movement speed by 50% for 6 seconds.\n* **Attack Slow**: Slows enemy attack speed by 50% for 6 seconds.\n* **Cooldown**: 15 seconds.\n* **Damage Cooldown**: 3 seconds after taking damage from an enemy hero or Roshan.\n\n**4. Usage Tips**\n\n* Use Overwhelming Blink to quickly reposition yourself or catch out enemies in a teamfight.\n* Try to use Overwhelming Blink in a way that allows you to quickly reposition yourself to safety after teleporting.\n* Use the damage and slow effects to control and eliminate enemies in a teamfight.\n* Be cautious when using Overwhelming Blink, as the damage cooldown can leave you vulnerable to counter-attacks.\n\n**5. Strategic Value**\n\n* Overwhelming Blink is a powerful tool for initiation and teamfighting, allowing the wielder to quickly reposition themselves and deal damage to enemies.\n* The damage and slow effects make it a valuable asset in late-game teamfights.\n* However, the high cost and cooldown of the item make it less suitable for early-game play.\n* Wielding an Overwhelming Blink requires a high level of game knowledge and execution, as the wielder must carefully plan and execute their teleportations to maximize the item's effects.",
        "abstract": "Overwhelming Blink is an item that allows its wielder to teleport up to 1200 units, dealing damage to enemies in a small radius and slowing their movement and attack speed, with a 15-second cooldown. The item's effects include dealing 100 + 50% of the wielder's strength as damage, applying a 50% movement and attack speed slow for 6 seconds, and dealing additional damage over time equal to 100% of the wielder's strength.",
        "metadata": {
            "cooldown_tag": "medium_cooldown",
            "mana_tag": "no_mana",
            "health_tag": "no_health",
            "cost_tag": "expensive",
            "damage_tag": "low_damage",
            "behavior_traits": [
                "ground-targeted",
                "toggleable",
                "ignore channel cancel"
            ],
            "special_attributes": {
                "blink_range": 1200,
                "blink_damage_cooldown": 3,
                "blink_range_clamp": 960,
                "bonus_strength": 25,
                "radius": 800,
                "movement_slow": 50,
                "attack_slow": 50,
                "duration": 6,
                "damage_base": 100,
                "damage_pct_instant": 50,
                "damage_pct_over_time": 100,
                "AbilityCastRange": 1200,
                "AbilityCooldown": 15
            },
            "components": [
                "Blink Dagger",
                "Reaver"
            ],
            "suggested_times": [
                "late"
            ],
            "id": 600,
            "name": "item_overwhelming_blink",
            "name_loc": "Overwhelming Blink",
            "desc_loc": "<h1>Active: Overwhelming Blink</h1> Teleport to a target point up to %blink_range% units away.<br><br>After teleportation, all enemies in a %radius% AoE take damage equal to %damage_base% + %damage_pct_instant%%% of your strength and an additional %damage_pct_over_time%%% over time, and have %movement_slow%%% movement speed slow and %attack_slow% attack speed slow for %duration% seconds. <br><br>Overwhelming Blink cannot be used for %blink_damage_cooldown% seconds after taking damage from an enemy hero or Roshan.",
            "lore_loc": "A horrifying dagger forged in the chaos maw and nigh untouchable by mortal hands.",
            "notes_loc": [
                "Self-casting will cause you to teleport in the direction of your team's fountain.",
                "If you used Overwhelming Blink to teleport to a distance over the maximum range, you'll be teleported 4/5 of the maximum range instead."
            ],
            "behavior": "274878432272",
            "damage": 2,
            "is_item": true,
            "item_cost": 6800,
            "item_neutral_tier": 4294967295,
            "item_quality": 1
        }
    },
    {
        "id": "item_603",
        "title": "Item: Swift Blink",
        "text": "**Item Report: Swift Blink**\n\n**1. Overview**\n\nSwift Blink is a powerful item that allows its wielder to teleport up to a certain range, gaining movement speed and agility bonuses upon arrival. This item is a combination of the Blink Dagger and Eaglesong, and is considered an expensive item that can be purchased late in the game.\n\n**2. Components**\n\nSwift Blink is composed of two components:\n\n* Blink Dagger\n* Eaglesong\n\n**3. Stats & Effects**\n\n* **Cooldown:** 15 seconds\n* **Mana Cost:** No mana cost\n* **Cost:** 6800 gold\n* **Active Effect:** Teleport up to 1200 units away to a target point. Upon arrival, gain 40% phased movement speed and 25 Agility for 6 seconds.\n* **Restrictions:**\n\t+ Cannot be used for 3 seconds after taking damage from an enemy hero or Roshan.\n\t+ Self-casting will cause the wielder to teleport in the direction of their team's fountain.\n\t+ Teleporting to a distance over the maximum range will result in a 4/5 range clamp.\n\n**4. Usage Tips**\n\n* Use Swift Blink to quickly reposition yourself or chase down enemies.\n* Combine with other items that provide movement speed or agility to enhance the effects of Swift Blink.\n* Be cautious when using Swift Blink in team fights, as the cooldown can leave you vulnerable to enemy attacks.\n\n**5. Strategic Value**\n\nSwift Blink is a game-changing item that can turn the tide of a battle in your favor. Its ability to teleport quickly and gain movement speed and agility bonuses makes it an excellent tool for:\n\n* Initiating team fights or ambushes\n* Chasing down fleeing enemies\n* Evading enemy attacks and positioning yourself for a better shot\n* Enhancing your overall movement speed and agility\n\nOverall, Swift Blink is a powerful item that can be a game-changer in the right situations. Its high cost and cooldown make it a situational item, but its effects can be devastating when used correctly.",
        "abstract": "Swift Blink is an item that allows its wielder to teleport up to 1200 units away, gaining 40% phased movement speed and 25 Agility for 6 seconds upon arrival, with a 15-second cooldown and no mana cost. It is composed of Blink Dagger and Eaglesong, costs 6800 gold, and has restrictions on its usage, such as a 3-second delay after taking damage from an enemy hero or Roshan.",
        "metadata": {
            "cooldown_tag": "medium_cooldown",
            "mana_tag": "no_mana",
            "health_tag": "no_health",
            "cost_tag": "expensive",
            "damage_tag": "no_damage",
            "behavior_traits": [
                "ground-targeted",
                "toggleable",
                "ignore channel cancel"
            ],
            "special_attributes": {
                "blink_range": 1200,
                "blink_damage_cooldown": 3,
                "blink_range_clamp": 960,
                "bonus_agility": 25,
                "bonus_movement": 40,
                "bonus_agi_active": 35,
                "duration": 6,
                "AbilityCastRange": 1200,
                "AbilityCooldown": 15
            },
            "components": [
                "Blink Dagger",
                "Eaglesong"
            ],
            "suggested_times": [
                "late"
            ],
            "id": 603,
            "name": "item_swift_blink",
            "name_loc": "Swift Blink",
            "desc_loc": "<h1>Active: Swift Blink</h1> Teleport to a target point up to %blink_range% units away.<br><br>After teleportation, you gain %bonus_movement%%% phased movement speed and +%bonus_agi_active% Agility for %duration% seconds. <br><br>Swift Blink cannot be used for %blink_damage_cooldown% seconds after taking damage from an enemy hero or Roshan.",
            "lore_loc": "A cunning blade able to anticipate and enable its bearer's movements.",
            "notes_loc": [
                "Self-casting will cause you to teleport in the direction of your team's fountain.",
                "If you used Swift Blink to teleport to a distance over the maximum range, you'll be teleported 4/5 of the maximum range instead."
            ],
            "behavior": "274878432272",
            "is_item": true,
            "item_cost": 6800,
            "item_neutral_tier": 4294967295,
            "item_quality": 1
        }
    },
    {
        "id": "item_604",
        "title": "Item: Arcane Blink",
        "text": "**Arcane Blink Item Report**\n\n**1. Overview**\n\nArcane Blink is a powerful item that allows the wielder to teleport to a target point up to 1400 units away. This item is a combination of two components: Blink Dagger and Mystic Staff. It provides a significant boost to the wielder's mana and health, making it an excellent addition to any carry or agility-focused hero.\n\n**2. Components**\n\n* Blink Dagger: A basic component that provides the core teleportation functionality.\n* Mystic Staff: A component that adds additional effects, including mana and health restoration.\n\n**3. Stats & Effects**\n\n* Cooldown: 9 seconds\n* Mana Cost: No mana cost\n* Health Cost: No health cost\n* Cost: 6800 gold\n* Behavior Traits:\n\t+ Ground-targeted\n\t+ Toggleable\n\t+ Ignore channel cancel\n* Special Attributes:\n\t+ Blink Range: 1400 units\n\t+ Blink Damage Cooldown: 3 seconds\n\t+ Bonus Intellect: 25\n\t+ Heal Amount: 250 health\n\t+ Mana Amount: 100 mana\n* Notes:\n\t+ Self-casting will cause the wielder to teleport in the direction of their team's fountain.\n\t+ If the wielder attempts to teleport to a distance over the maximum range, they will be teleported 4/5 of the maximum range instead.\n\n**4. Usage Tips**\n\n* Arcane Blink is best used for quick repositioning, chasing, or escaping from enemies.\n* Try to use Arcane Blink in combination with other abilities to maximize its effectiveness.\n* Be cautious not to use Arcane Blink too frequently, as the cooldown can be quite long.\n* Use the self-casting feature to teleport to your team's fountain for a quick escape or repositioning.\n\n**5. Strategic Value**\n\n* Arcane Blink is a game-changing item for carry and agility-focused heroes, providing them with unparalleled mobility and flexibility.\n* Its ability to restore health and mana makes it an excellent addition to any team, allowing heroes to stay in fights longer and take more risks.\n* The item's high cost and long cooldown make it a luxury item that should be used judiciously, but its strategic value makes it well worth the investment.\n\nOverall, Arcane Blink is an incredibly powerful item that can turn the tide of battle in favor of the wielder. Its unique combination of teleportation, healing, and mana restoration makes it an essential addition to any carry or agility-focused hero's arsenal.",
        "abstract": "Arcane Blink is a powerful item that allows the wielder to teleport up to 1400 units away, restoring 250 health and 100 mana, with a 9-second cooldown and no mana or health cost. It provides 25 bonus intellect and has a high gold cost of 6800, making it a luxury item best suited for carry and agility-focused heroes.",
        "metadata": {
            "cooldown_tag": "short_cooldown",
            "mana_tag": "no_mana",
            "health_tag": "no_health",
            "cost_tag": "expensive",
            "damage_tag": "no_damage",
            "behavior_traits": [
                "ground-targeted",
                "toggleable",
                "ignore channel cancel"
            ],
            "special_attributes": {
                "blink_range": 1400,
                "blink_damage_cooldown": 3,
                "blink_range_clamp": 1120,
                "bonus_intellect": 25,
                "heal_amount": 250,
                "mana_amount": 100,
                "AbilityCastRange": 1400,
                "AbilityCooldown": 9
            },
            "components": [
                "Blink Dagger",
                "Mystic Staff"
            ],
            "suggested_times": [
                "late"
            ],
            "id": 604,
            "name": "item_arcane_blink",
            "name_loc": "Arcane Blink",
            "desc_loc": "<h1>Active: Arcane Blink</h1> Teleport to a target point up to %blink_range% units away. <br><br>After teleportation, you restore %heal_amount% health and %mana_amount% mana.<br><br>Arcane Blink cannot be used for %blink_damage_cooldown% seconds after taking damage from an enemy hero or Roshan.",
            "lore_loc": "A revitalizing tool to help bear the weight of arcane expenditure.",
            "notes_loc": [
                "Self-casting will cause you to teleport in the direction of your team's fountain.",
                "If you used Arcane Blink to teleport to a distance over the maximum range, you'll be teleported 4/5 of the maximum range instead."
            ],
            "behavior": "274878432272",
            "is_item": true,
            "item_cost": 6800,
            "item_neutral_tier": 4294967295,
            "item_quality": 1
        }
    },
    {
        "id": "item_606",
        "title": "Item: Arcane Blink Recipe",
        "text": "**Arcane Blink Recipe Item Report**\n\n**1. Overview**\n\nThe Arcane Blink Recipe is a rare item recipe in Dota 2 that allows players to craft the Arcane Blink item. This recipe is a key component in creating a powerful utility item that enables a hero to teleport a short distance.\n\n**2. Components**\n\nThe Arcane Blink Recipe requires the following components to be crafted:\n\n* 750 Gold\n* 1 Cosmic Blade\n* 1 Blinking Scarf\n\n**3. Stats & Effects**\n\nThe Arcane Blink Recipe itself does not have any direct stats or effects. However, when crafted into the Arcane Blink item, it provides the following effects:\n\n* **Teleport**: Teleports the hero a short distance ( approximately 1200 units) to a target location, revealing it for 1 second and dealing 120 damage to enemies within the area.\n\n**4. Usage Tips**\n\nWhen using the Arcane Blink item, consider the following tips:\n\n* Use Arcane Blink to quickly reposition yourself in team fights or to escape from danger.\n* Try to blink into a location where you can quickly attack or set up an ambush.\n* Be mindful of the cooldown time and try to save Arcane Blink for critical situations.\n\n**5. Strategic Value**\n\nThe Arcane Blink Recipe has significant strategic value in Dota 2, particularly for heroes who rely on positioning and mobility. With this recipe, players can create a powerful utility item that enables them to control the battlefield and catch enemies off guard. The Arcane Blink item is particularly useful for:\n\n* Initiating team fights or setting up ambushes.\n* Escaping from danger or repositioning quickly.\n* Controlling key objectives or areas of the map.\n\nOverall, the Arcane Blink Recipe is a valuable component in creating a powerful utility item that can greatly impact the outcome of a match.",
        "abstract": "The Arcane Blink Recipe is a rare item recipe in Dota 2 that requires 750 gold, 1 Cosmic Blade, and 1 Blinking Scarf to craft the Arcane Blink item, which allows a hero to teleport a short distance, dealing damage to enemies within the area. When crafted, the Arcane Blink item provides a powerful utility effect, enabling heroes to control the battlefield, initiate team fights, and escape from danger.",
        "metadata": {
            "cooldown_tag": "no_cooldown",
            "mana_tag": "no_mana",
            "health_tag": "no_health",
            "cost_tag": "moderate",
            "damage_tag": "no_damage",
            "id": 606,
            "name": "item_recipe_arcane_blink",
            "name_loc": "Arcane Blink Recipe",
            "behavior": "0",
            "is_item": true,
            "item_cost": 1750,
            "item_neutral_tier": 4294967295,
            "item_quality": 1
        }
    },
    {
        "id": "item_607",
        "title": "Item: Swift Blink Recipe",
        "text": "**Item Report: Swift Blink Recipe**\n\n**1. Overview**\n\nThe Swift Blink Recipe is a moderate-cost item recipe in Dota 2, used to craft the Swift Blink item. This recipe is a crucial component for heroes who rely on swift and agile movements to outmaneuver their opponents.\n\n**2. Components**\n\nTo craft the Swift Blink Recipe, you need to have the following items in your inventory:\n\n* 1 Orchid Malevolence\n* 1 Butterfly\n\n**3. Stats & Effects**\n\nThe Swift Blink Recipe itself does not provide any direct stats or effects. However, when crafted into the Swift Blink item, it provides the following stats:\n\n* 30% movement speed bonus\n* Ability to blink ( teleport) to a target location\n\n**4. Usage Tips**\n\nWhen using the Swift Blink item, keep the following tips in mind:\n\n* Use the blink ability to quickly reposition yourself or escape from danger.\n* Blinking can be used to initiate team fights or catch out enemy heroes.\n* Be cautious when using blink in tight spaces, as it can make you vulnerable to ambushes.\n* Use the movement speed bonus to quickly close the distance to enemy heroes or chase down fleeing enemies.\n\n**5. Strategic Value**\n\nThe Swift Blink Recipe and its resulting item are highly valuable in Dota 2, particularly for heroes who rely on agility and mobility. Some heroes who benefit from this item include:\n\n* Anti-Mage: Swift Blink's movement speed bonus and blink ability allow Anti-Mage to quickly close the distance to enemy heroes and chase down fleeing enemies.\n* Phantom Assassin: Phantom Assassin's blink ability and movement speed bonus make her a formidable opponent in team fights, allowing her to quickly reposition and catch out enemy heroes.\n* Pudge: Pudge's movement speed bonus and blink ability make him a more agile and formidable opponent, allowing him to quickly chase down enemy heroes and catch out stragglers.\n\nOverall, the Swift Blink Recipe and its resulting item are highly valuable in Dota 2, particularly for heroes who rely on agility and mobility.",
        "abstract": "The Swift Blink Recipe is a moderate-cost item recipe in Dota 2 that requires an Orchid Malevolence and a Butterfly to craft, and when completed, the Swift Blink item provides a 30% movement speed bonus and the ability to blink to a target location. The item is highly valuable for heroes who rely on agility and mobility, such as Anti-Mage, Phantom Assassin, and Pudge.",
        "metadata": {
            "cooldown_tag": "no_cooldown",
            "mana_tag": "no_mana",
            "health_tag": "no_health",
            "cost_tag": "moderate",
            "damage_tag": "no_damage",
            "id": 607,
            "name": "item_recipe_swift_blink",
            "name_loc": "Swift Blink Recipe",
            "behavior": "0",
            "is_item": true,
            "item_cost": 1750,
            "item_neutral_tier": 4294967295,
            "item_quality": 1
        }
    },
    {
        "id": "item_608",
        "title": "Item: Overwhelming Blink Recipe",
        "text": "**Report: Overwhelming Blink Recipe**\n\n**1. Overview**\n\nThe Overwhelming Blink Recipe is a recipe item in Dota 2 that allows players to craft the Overwhelming Blink item. It is a moderate-cost item with a recipe cost of 1750 gold.\n\n**2. Components**\n\nThe Overwhelming Blink Recipe requires the following components to be crafted:\n\n* \n* \n\n**3. Stats & Effects**\n\nAs a recipe item, the Overwhelming Blink Recipe does not have any direct stats or effects. Its purpose is to allow players to craft the Overwhelming Blink item, which provides the following stats and effects:\n\n* Cooldown: 12 seconds\n* Mana Cost: 120\n* Movement Speed: 30%\n* Casting Speed: 20%\n* Attack Speed: 20%\n* Armor: 5\n* Damage: 40-60\n\n**4. Usage Tips**\n\nThe Overwhelming Blink Recipe is not a consumable item and does not provide any direct benefits to the player. Its purpose is to allow players to craft the Overwhelming Blink item, which can be used by heroes to move quickly around the map and reposition themselves in team fights.\n\nTo use the Overwhelming Blink Recipe, players must have the required components in their inventory and have enough gold to purchase the recipe. Once the recipe is crafted, players can use the Overwhelming Blink item by selecting it from their inventory and using it in-game.\n\n**5. Strategic Value**\n\nThe Overwhelming Blink Recipe has significant strategic value in Dota 2, particularly for heroes that rely on mobility and repositioning in team fights. By crafting the Overwhelming Blink item, players can gain a significant advantage in terms of movement speed and casting speed, allowing them to quickly move around the map and reposition themselves to catch enemies off guard.\n\nIn addition, the Overwhelming Blink item provides a significant amount of damage, making it a valuable asset in team fights. Players who craft the Overwhelming Blink item can use it to quickly close the distance to enemies, catch them off guard, and deal significant damage.\n\nOverall, the Overwhelming Blink Recipe is a valuable item in Dota 2, particularly for players who rely on mobility and repositioning in team fights. Its strategic value is high, and players who craft the Overwhelming Blink item can gain a significant advantage in terms of movement speed, casting speed, and damage.",
        "abstract": "The Overwhelming Blink Recipe is a moderate-cost item with a recipe cost of 1750 gold, requiring specific components to craft the Overwhelming Blink item. The crafted item provides benefits including increased movement speed, casting speed, attack speed, armor, and damage, making it valuable for heroes relying on mobility and repositioning in team fights.",
        "metadata": {
            "cooldown_tag": "no_cooldown",
            "mana_tag": "no_mana",
            "health_tag": "no_health",
            "cost_tag": "moderate",
            "damage_tag": "no_damage",
            "id": 608,
            "name": "item_recipe_overwhelming_blink",
            "name_loc": "Overwhelming Blink Recipe",
            "behavior": "0",
            "is_item": true,
            "item_cost": 1750,
            "item_neutral_tier": 4294967295,
            "item_quality": 1
        }
    },
    {
        "id": "item_2",
        "title": "Item: Blades of Attack",
        "text": "**Blades of Attack Item Report**\n\n**1. Overview**\n\nBlades of Attack is a passive item in Dota 2 that provides bonus damage to attacks. It is a relatively cheap item that can be purchased early in the game, making it a popular choice among players who want to increase their damage output.\n\n**2. Components**\n\nBlades of Attack is a simple item that does not have any components. It is a standalone item that can be purchased from the shop.\n\n**3. Stats & Effects**\n\n* **Cost:** 450 gold\n* **Behavior:** Passive\n* **Special Attributes:**\n\t+ **Bonus Damage:** +9 damage to attacks\n* **Stats:** None\n\n**4. Usage Tips**\n\nBlades of Attack is a straightforward item that provides a simple bonus to damage output. Here are some usage tips to keep in mind:\n\n* Purchase Blades of Attack as soon as possible if you're playing a physical damage carry hero.\n* Combine Blades of Attack with other damage-boosting items, such as Phase Boots or Steel Dagger, to increase your damage output.\n* Use Blades of Attack to take down enemy heroes with low health, as the bonus damage can make a big difference in the outcome of a fight.\n\n**5. Strategic Value**\n\nBlades of Attack is a valuable item in Dota 2 for several reasons:\n\n* **Early Game:** Blades of Attack can be purchased early in the game, making it a great choice for heroes who rely on physical damage to take down enemy heroes.\n* **Situational:** Blades of Attack is a situational item that provides a specific benefit to physical damage carries. It can be a great choice for heroes like Phantom Assassin, Ursa, or Anti-Mage.\n* **Synergy:** Blades of Attack can be combined with other items to create a powerful damage-boosting synergy. For example, pairing Blades of Attack with Phase Boots and Steel Dagger can make a hero nearly unstoppable in the late game.\n\nOverall, Blades of Attack is a solid choice for heroes who rely on physical damage to take down enemy heroes. Its simple design and passive behavior make it easy to use, and its bonus damage can make a big difference in the outcome of a fight.",
        "abstract": "Blades of Attack is a passive item in Dota 2 that provides a +9 bonus damage to attacks, making it a popular choice among physical damage carry heroes. It can be purchased for 450 gold and has no components or additional stats, making it a straightforward and relatively cheap item to acquire.",
        "metadata": {
            "cooldown_tag": "no_cooldown",
            "mana_tag": "no_mana",
            "health_tag": "no_health",
            "cost_tag": "cheap",
            "damage_tag": "no_damage",
            "behavior_traits": [
                "passive"
            ],
            "special_attributes": {
                "bonus_damage": 9
            },
            "id": 2,
            "name": "item_blades_of_attack",
            "name_loc": "Blades of Attack",
            "lore_loc": "The damage of these small, concealable blades should not be underestimated.",
            "behavior": "2",
            "is_item": true,
            "item_cost": 450,
            "item_neutral_tier": 4294967295,
            "item_quality": 1
        }
    },
    {
        "id": "item_3",
        "title": "Item: Broadsword",
        "text": "**Broadsword Item Report**\n\n**1. Overview**\n\nThe Broadsword is a moderate-cost item in Dota 2 that provides a bonus damage output to the wielder. As a classic sword, it's a staple in the inventory of many heroes, particularly those who rely on physical damage.\n\n**2. Components**\n\nThe Broadsword is a single-component item, meaning it doesn't have any additional parts or upgrades.\n\n**3. Stats & Effects**\n\n* **Bonus Damage**: +15 damage output\n* **Cost**: 1000 gold\n* **Item Quality**: Common ( Tier 1)\n* **Behavior**: Passive\n\n**4. Usage Tips**\n\nThe Broadsword is a straightforward item that provides a flat damage bonus. To maximize its effectiveness, pair it with heroes who rely on physical damage, such as:\n\n* Carry heroes like Ursa, Anti-Mage, or Phantom Assassin\n* Melee heroes like Juggernaut, Ursa, or Slark\n* Heroes with high attack speed, like Templar Assassin or Bristleback\n\nKeep in mind that the Broadsword doesn't provide any additional stats like health, mana, or attack speed, so it's essential to balance its usage with other items and abilities.\n\n**5. Strategic Value**\n\nThe Broadsword is a solid, mid-game item that provides a moderate damage boost. Its strategic value lies in its ability to:\n\n* Increase the overall damage output of a hero\n* Complement heroes with high attack speed or critical strike chance\n* Provide a reliable damage boost in the mid-game, where gold and item income are more consistent\n\nHowever, the Broadsword's effectiveness diminishes in the late game, where more powerful items and abilities become available. As such, it's essential to prioritize the Broadsword in the mid-game, but be prepared to upgrade to more powerful items as the game progresses.",
        "abstract": "The Broadsword is a moderate-cost item in Dota 2 that provides a +15 bonus damage output to the wielder, making it a staple for heroes who rely on physical damage, and can be purchased for 1000 gold. It is a single-component item with a passive behavior and common item quality, best paired with carry, melee, or high-attack-speed heroes to maximize its effectiveness.",
        "metadata": {
            "cooldown_tag": "no_cooldown",
            "mana_tag": "no_mana",
            "health_tag": "no_health",
            "cost_tag": "moderate",
            "damage_tag": "no_damage",
            "behavior_traits": [
                "passive"
            ],
            "special_attributes": {
                "bonus_damage": 15
            },
            "id": 3,
            "name": "item_broadsword",
            "name_loc": "Broadsword",
            "lore_loc": "The classic weapon of choice for knights, this blade is sturdy and reliable for slaying enemies.",
            "behavior": "2",
            "is_item": true,
            "item_cost": 1000,
            "item_neutral_tier": 4294967295,
            "item_quality": 1
        }
    },
    {
        "id": "item_4",
        "title": "Item: Chainmail",
        "text": "**Chainmail Item Report**\n\n**1. Overview**\n\nChainmail is a moderate-cost item that provides passive protection for the wearer. It is a basic armor item that can be obtained by players early in the game.\n\n**2. Components**\n\nChainmail is a single item that does not have any components or upgrades.\n\n**3. Stats & Effects**\n\n* **Cost**: 550 gold\n* **Behavior**: Passive\n* **Special Attributes**:\n\t+ **Bonus Armor**: +4\n* **Tags**:\n\t+ No cooldown\n\t+ No mana\n\t+ No health\n\t+ No damage\n\n**4. Usage Tips**\n\n* Chainmail is a basic armor item that provides a moderate amount of protection against physical damage.\n* It is recommended to purchase Chainmail as soon as possible in the game, as it provides a good amount of armor at a relatively low cost.\n* Players who prioritize damage output may not prioritize Chainmail, but it is a good item for players who focus on survivability and tanking.\n\n**5. Strategic Value**\n\n* Chainmail provides a moderate amount of armor, making it a good item for players who want to increase their survivability in the early game.\n* It is particularly useful for heroes who rely on physical damage, as it can help them stay alive longer in team fights.\n* Chainmail is also a good item for players who want to build a tanky carry or a support hero, as it provides a good amount of protection without affecting their damage output.\n\nOverall, Chainmail is a solid, if unremarkable, item that provides a moderate amount of protection at a relatively low cost. While it may not be the most exciting item, it is a good choice for players who want to build a survivable hero.",
        "abstract": "Chainmail is a basic armor item that provides +4 bonus armor and costs 550 gold, offering moderate protection against physical damage. It is a good early-game purchase for heroes who prioritize survivability and tanking, particularly those who rely on physical damage.",
        "metadata": {
            "cooldown_tag": "no_cooldown",
            "mana_tag": "no_mana",
            "health_tag": "no_health",
            "cost_tag": "moderate",
            "damage_tag": "no_damage",
            "behavior_traits": [
                "passive"
            ],
            "special_attributes": {
                "bonus_armor": 4
            },
            "id": 4,
            "name": "item_chainmail",
            "name_loc": "Chainmail",
            "lore_loc": "A medium weave of metal chains.",
            "behavior": "2",
            "is_item": true,
            "item_cost": 550,
            "item_neutral_tier": 4294967295,
            "item_quality": 1
        }
    },
    {
        "id": "item_5",
        "title": "Item: Claymore",
        "text": "**Item Report: Claymore**\n\n**1. Overview**\n\nThe Claymore is a moderate-cost item in Dota 2 that provides a bonus damage boost to the wielder. It is a commonly chosen first item for agility heroes, allowing them to deal more damage to enemies.\n\n**2. Components**\n\nThe Claymore does not have any components. It is a standalone item that can be purchased by heroes.\n\n**3. Stats & Effects**\n\n* **Cost:** 1350 gold\n* **Behavior:** Passive\n* **Special Attributes:**\n\t+ **Bonus Damage:** +20 damage to attacks\n* **No cooldown, no mana cost, and no health gain**\n\n**4. Usage Tips**\n\n* The Claymore is a great starting item for agility heroes who rely on physical damage to take down enemies.\n* It pairs well with items that provide additional damage or critical strike chance, such as Blade Mail or Monkey King Bar.\n* Heroes with high attack speed, such as Phantom Assassin or Anti-Mage, can benefit from the Claymore's bonus damage.\n* The Claymore is not recommended for heroes who rely on magic damage or have low attack speed.\n\n**5. Strategic Value**\n\nThe Claymore provides a significant damage boost to agility heroes, making it a valuable item in the early game. Its passive effect allows heroes to deal more damage to enemies, increasing their overall damage output. However, it is not a game-changing item and can be countered by enemy heroes with high armor or magic resistance. Overall, the Claymore is a solid starting item for agility heroes, but its effectiveness decreases in the late game as other items become more powerful.",
        "abstract": "The Claymore is a standalone item in Dota 2 that costs 1350 gold and provides a passive bonus of +20 damage to attacks, making it a popular first item for agility heroes. It is particularly effective for heroes with high attack speed, such as Phantom Assassin or Anti-Mage, and pairs well with items that provide additional damage or critical strike chance.",
        "metadata": {
            "cooldown_tag": "no_cooldown",
            "mana_tag": "no_mana",
            "health_tag": "no_health",
            "cost_tag": "moderate",
            "damage_tag": "no_damage",
            "behavior_traits": [
                "passive"
            ],
            "special_attributes": {
                "bonus_damage": 20
            },
            "id": 5,
            "name": "item_claymore",
            "name_loc": "Claymore",
            "lore_loc": "A sword that can cut through armor, it's a commonly chosen first weapon for budding swordsmen.",
            "behavior": "2",
            "is_item": true,
            "item_cost": 1350,
            "item_neutral_tier": 4294967295,
            "item_quality": 1
        }
    }
]